Revit 2024 API
PipeFittingAndAccessoryPressureDropUIDataItem.GetPipeFittingAndAccessoryData Method
 Gets the fitting data stored in the UI data item.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData()
Visual Basic
Public Function GetPipeFittingAndAccessoryData As PipeFittingAndAccessoryData
Visual C++
public:
PipeFittingAndAccessoryData^ GetPipeFittingAndAccessoryData()
Return Value
 The fitting data stored in the UI data item.
See Also
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace